[
    {
        "date": "January 2019",
        "title": "From Hobby to Passion: Discovering the Joy of Coding in 12th Grade",
        "description": "During my 12th grade, I embarked on a journey that would change my life forever. What started as a mere hobby quickly transformed into a deep-rooted passion for coding. The thrill of solving problems, creating something from scratch, and seeing the results firsthand ignited a fire within me."
    },
    {
        "date": "June 2019",
        "title": "College Days: Practicing, Projects, and Passionate Pursuits",
        "description": "Throughout my college days, I immersed myself in the world of programming. I dedicated countless hours to honing my skills, embracing every opportunity to practice and expand my knowledge. It was during this time that I undertook various projects, applying what I had learned and challenging myself to push the boundaries of my abilities."
    },
    {
        "date": "October 2020",
        "title": "Freelancing Adventures: HTML, CSS, JS, and TailwindCSS",
        "description": "As I continued to grow as a developer, I ventured into the world of freelancing. Specializing in HTML, CSS, and JavaScript, with a particular focus on the versatile TailwindCSS framework, I collaborated with clients to bring their visions to life. This freelancing experience allowed me to gain practical experience, refine my coding skills, and learn the importance of meeting client expectations."
    },
    {
        "date": "September 2022",
        "title": "Leveling Up with React: Expanding Skills as a Freelancer",
        "description": "Following the completion of my college education, I embarked on a new chapter as a freelance developer, with React as my primary focus. Engaging in various React projects, I honed my expertise in this powerful JavaScript library. Working independently, I faced new challenges head-on, further refining my problem-solving abilities and expanding my knowledge of frontend development."
    },
    {
        "date": "June 2023",
        "title": "Starting at NTWIST: Gaining Professional Experience",
        "description": "I joined NTWIST in Hyderabad as a MERN stack developer. In this role, I have worked on a variety of complex projects, contributing to both frontend and backend development. The experience has enabled me to deepen my expertise in the MERN stack and collaborate with a talented team. I've tackled diverse challenges, developed solutions that meet high standards, and continued to enhance my skills in a professional setting."
    },
    {
        "date": "Present",
        "title": "Exploring New Opportunities: Looking for Growth",
        "description": "With over a year of experience at nTwist, I am now exploring new opportunities that offer further growth and challenges. I am eager to leverage my skills in a dynamic environment that aligns with my career aspirations and allows me to make a meaningful impact."
    }
]
